---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemExactWeight
source: html/782d5402-f75c-be3c-7d7f-90ae6ed72d03.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemExactWeight Property

"Exact Weight"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemExactWeight { get; }
```